RSC:
* https://s3.amazonaws.com/assets.datacamp.com/blog_assets/PandasPythonForDataScience.pdf
* https://pandas.pydata.org/pandas-docs/version/0.22.0/10min.html
* https://realpython.com/python-data-cleaning-numpy-pandas/

### <center style = 'color : red '>  PANDAS : Python Data Analysis Library </center>
مكتبة بايثون لتحليل البيانات 

The Pandas library is built on NumPy and provides easy-to-use
data structures and data analysis tools for the Python
programming language

مكتبة بانداس هي مبنية على مكتبة نامباي و توفر هياكل بنيوية سهلة الاستعمال و أدوات لتحليل البيانات من أجل البرمجة باستعمال لغة بايثون

https://pandas.pydata.org/

In [6]:
import numpy as np
import pandas as pd

* The pandas series object can be seen as an enhanced numpy 1D array and the pandas dataframe can be seen as an enhanced numpy 2D array. 

يمكن اعتبار سيريز في بانداس كمصفوفة نامباي مدعمة و داتا فريم كمصفوفة نامباي من الدرجة الثانية و التي هي الاخرى مدعمة 

* The main difference is that pandas series and pandas dataframes has explicit index, while numpy arrays has implicit indexation. So, in any python code that you think to use something like

الفرق الاهم هو كون السيريز تتوفر على تاشير بديهي بينما المصفوفات في نامباي هي تتوفر فقط على باشير 

```python
import numpy as np
a = np.array([1,2,3])
```
you can just use
```python
import pandas as pd
a = pd.Series([1,2,3])
```

All the functions and methods from numpy arrays will work with pandas series. 

مختلف الوظائف في نامباي يمكن استعمالها في بانداس

is there any performance differences between a numpy array and pandas series ?
هل هنالك فرق في الاداء بين نامباي و بانداس؟

in fact Pandas is much slower than NumPy, because Pandas is doing a lot of stuff when you index into a Series, and it’s doing that stuff in Python

## <center style = "color:blue"> series </center>

A one-dimensional labeled array capable of holding any data type 
مصفوفة احادية البعد قادرة على احتواء اي نوع من البيانات 

* pandas create a default integer index بانداس يخلق قهرس رقمي بشكل تلقائي

In [32]:
s = pd.Series(
    [3,-2,1,4]
)

In [33]:
s

0    3
1   -5
2    7
3    4
dtype: int64

In [34]:
type(s)

pandas.core.series.Series

In [28]:
# Get one element
s[0]

3

### index of string - استعمال فهرس غير رقمي

In [38]:
s = pd.Series(
    [3,-2,1,4], 
    index=['a', 'b', 'c', 'd']
)

In [5]:
s['b']

-5

### index of dates

In [3]:
dates = pd.date_range('20190301', periods=6)
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
col_list = ['col1','col2','col3','col4']

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index=dates, 
                  columns=col_list)
df

                col1      col2      col3      col4
2019-03-01 -0.068182 -0.041800  0.295510  1.219997
2019-03-02 -1.369290  1.202142  1.098110  0.984760
2019-03-03 -0.591641 -0.794132  0.286296  0.390915
2019-03-04 -1.203081  0.322565  1.089021 -0.610429
2019-03-05  0.901084 -1.387498 -0.378040 -1.300695
2019-03-06 -2.186943  0.068376  0.484383 -0.768678

### Boolean Indexing

In [9]:
s = pd.Series([3,-2,1,4])
s

0    3
1   -2
2    1
3    4
dtype: int64

In [10]:
# Series s where value is >1
s[s > 1]

0    3
3    4
dtype: int64

In [ ]:
# Series s where value is not >1
s[~(s > 1)]

In [11]:
# s where value is <-1 or >2
s[(s < -1) | (s >= 3)]

0    3
1   -2
3    4
dtype: int64

In [ ]:
# Setting
s[2] = -6 # Set index a of Series s to 6

### <center style = 'color : blue '> Data Alignment </center>

In [14]:
s = pd.Series(
    [3,-2,1,4,1], 
    index=['a', 'b', 'c', 'd','e']
)

s

a    3
b   -2
c    1
d    4
e    1
dtype: int64

In [16]:
s2 = pd.Series([-2, 7, 3, -5, 1], index=['a', 'c', 'd','e','f'])
s2

a   -2
c    7
d    3
e   -5
f    1
dtype: int64

### add

In [44]:
s.add(s2, fill_value=0)

a    10.0
b    -5.0
c     5.0
d     7.0
e     5.0
dtype: float64

### sub

In [1]:
s.sub(s2, fill_value=0)

NameError: name 's' is not defined

In [46]:
s.sub(s3, fill_value=2)

a   -4.0
b   -7.0
c    9.0
d    1.0
e   -3.0
dtype: float64

### div

In [47]:
s.div(s3, fill_value=4)

a    0.428571
b   -1.250000
c   -3.500000
d    1.333333
e    0.800000
dtype: float64

### mul

In [48]:
s.mul(s3, fill_value=0)

a    21.0
b   -15.0
c   -14.0
d    12.0
e    15.0
dtype: float64

### Drop a values - حذف قيم

In [1]:
# Drop values from rows (axis=0)
s.drop(['a', 'c'])

NameError: name 's' is not defined

## <center style = "color:blue"> Data Frame </center>

A two-dimensional labeled data structure with columns of potentially different types 
هيكل بيانات ثنائي الابعاد باعمدة قد تحتوي على بيانات من انواع مختلفة

### Create a dataframe from a dictionary -   خلق الداتا فريم

In [17]:
data = {
    'Country': ['Morocco', 'China', 'France','Indonesia','Spain'],
    'Capital': ['Rabat', 'Beijing', 'Paris','Jakarta','Madrid'],
    'Population': [30000000, 1000000000, 80000000,130000000,75000000]
}

df = pd.DataFrame(
    data,
    columns=['Country', 'Capital', 'Population']
)

In [18]:
df

     Country  Capital  Population
0    Morocco    Rabat    30000000
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [19]:
df.head(10) # الحصول على اول الصفوف

     Country  Capital  Population
0    Morocco    Rabat    30000000
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [20]:
df.tail(3) # الحصول على اخر الصفوف

     Country  Capital  Population
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [21]:
df.info() # Info on DataFrame معلومات عن

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Country       5 non-null object
Capital       5 non-null object
Population    5 non-null int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [22]:
print(df.index) # الحصول على الفهرس 
print(df.columns) # لائحة الاعمدة

RangeIndex(start=0, stop=5, step=1)
Index(['Country', 'Capital', 'Population'], dtype='object')

In [27]:
print('shape : ', df.shape) # (rows,columns) شكل الهيكل

shape :  (5, 3)

In [29]:
df.describe() # Summary statistics - احصاءات

         Population
count  5.000000e+00
mean   2.630000e+08
std    4.135154e+08
min    3.000000e+07
25%    7.500000e+07
50%    8.000000e+07
75%    1.300000e+08
max    1.000000e+09

### Data frame selection & filtering - التصفية

In [31]:
df['Country']

0      Morocco
1        China
2       France
3    Indonesia
4        Spain
Name: Country, dtype: object

In [32]:
df[['Country','Population']] # اخد عمودين فقط

     Country  Population
0    Morocco    30000000
1      China  1000000000
2     France    80000000
3  Indonesia   130000000
4      Spain    75000000

In [33]:
# boolean filtering 
df[df['Population']>60000000] # Use filter to adjust DataFrame

     Country  Capital  Population
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [34]:
# Getting element  
df[:] # Get subset of a DataFram - الحصول على مجموعة ضمنية

     Country  Capital  Population
0    Morocco    Rabat    30000000
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

In [35]:
# Getting element  
df[1:] # Get subset of a DataFram

     Country  Capital  Population
1      China  Beijing  1000000000
2     France    Paris    80000000
3  Indonesia  Jakarta   130000000
4      Spain   Madrid    75000000

-----

In [ ]:
df[1:,2] # attention : error

In [37]:
df[1:,['Capital']] # attention : error

TypeError: unhashable type: 'slice'

### loc (locate) - حدد

In [19]:
df.loc[0]

Country        Morocco
Capital          Rabat
Population    30000000
Name: 0, dtype: object

In [13]:
# By Label
df.loc[[0], ['Country']] #Select single value by row &column labels

   Country
0  Morocco

In [38]:
# By Label
df.loc[:, ['Population']] #Select single value by row &column labels

   Population
0    30000000
1  1000000000
2    80000000
3   130000000
4    75000000

#### iloc (index location) - التحديد باستعمال التاشير

In [17]:
# By Position
df.iloc[0,0] # Select single value by row & column

'Morocco'

In [26]:
# By Position
df.iloc[1:4,[0,1]] # Select single value by row & column

     Country  Capital
1      China  Beijing
2     France    Paris
3  Indonesia  Jakarta

### Dropping columns/rows - حذف عمود او صف

In [24]:
#Dropping
df.drop('Capital', axis=1) # Drop values from columns(axis=1)

   Capital  Population
0    Rabat    30000000
1  Beijing  1000000000
2    Paris    80000000

### Sort & Rank - الفرز و الترتيب

In [53]:
df.sort_index() #Sort by labels along an axis

   Country  Capital  Population
0  Morocco    Rabat    30000000
1    China  Beijing  1000000000
2   France    Paris    80000000

In [54]:
# Sort by the values along an axis
df.sort_values(by='Population') # by = 'Country'

   Country  Capital  Population
1    China  Beijing  1000000000
2   France    Paris    80000000
0  Morocco    Rabat    30000000

In [ ]:
# Sort by the values along an axis
df.sort_values(by = 'Country') #

In [55]:
# Assign ranks to entries
df.rank()

   Country  Capital  Population
0      3.0      3.0         1.0
1      1.0      1.0         3.0
2      2.0      2.0         2.0

In [28]:
df['Population_rank'] = df['Population'].rank()
df

     Country  Capital  Population  country_rank  Population_rank
0    Morocco    Rabat    30000000           4.0              1.0
1      China  Beijing  1000000000           1.0              5.0
2     France    Paris    80000000           2.0              3.0
3  Indonesia  Jakarta   130000000           3.0              4.0
4      Spain   Madrid    75000000           5.0              2.0

### Summary

### sum - المجموع

In [63]:
df.sum() # Sum of values

Country       MoroccoChinaFrance
Capital        RabatBeijingParis
Population            1110000000
dtype: object

### cumsum - الجمع التراكمي

In [39]:
df.cumsum() # Cummulative sum of values

,Country,Capital,Population
0,Morocco,Rabat,30000000
1,MoroccoChina,RabatBeijing,1030000000
2,MoroccoChinaFrance,RabatBeijingParis,1110000000
3,MoroccoChinaFranceIndonesia,RabatBeijingParisJakarta,1240000000
4,MoroccoChinaFranceIndonesiaSpain,RabatBeijingParisJakartaMadrid,1315000000

###  min and max

In [54]:
print(df["Population"].min())
df["Population"].max() # Minimum/maximum values

30000000

1000000000

### how much percentage does chin'as population represents in our dataset
### كم تمثل ساكنة الصين بالنسبة للساكنة في قاعدة بياناتنا

In [ ]:
df[df['Country']=='China']['Population'] / df['Population'].cumsum().max()

### idxmin and idxmax - الحصول على باشير اكبر و اصغر قيمة

In [58]:
df['Population'].idxmin()

0

1

In [ ]:
df['Population'].idxmax() # Minimum/Maximum index value

## mean & median

In [ ]:
df.mean() # Mean of values

In [ ]:
df.median() # Median of values

### <center style='color:blue'> Applying Functions - تطبيق دالة</center>

In [70]:
f = lambda x: x*2

In [71]:
df.apply(f) # Apply function

          Country         Capital  Population
0  MoroccoMorocco      RabatRabat    60000000
1      ChinaChina  BeijingBeijing  2000000000
2    FranceFrance      ParisParis   160000000

In [72]:
df.applymap(f) # Apply function element-wise

          Country         Capital  Population
0  MoroccoMorocco      RabatRabat    60000000
1      ChinaChina  BeijingBeijing  2000000000
2    FranceFrance      ParisParis   160000000

In [1]:
df['Population'].apply(lambda x:x/3+1) # Apply function

NameError: name 'df' is not defined

In [ ]:
df['Population'] # didn't change ?!

### create a new column - انشائ عمود جديد

In [ ]:
df['new_column'] = df['Population'].apply(lambda x:x/3+1) # Apply function

In [ ]:
df

### <center style='color:blue'> create dataframe from a file - الانشائ انطلاقا من ملف </center>

### csv file

In [62]:
df = pd.read_csv("data\\Fire_Department_Calls_for_Service_03_23_2019.csv",
                sep = ',')
df.head()

,Call Number,Unit ID,Incident Number,Call Type,Call Date,Watch Date,Received DtTm,Entry DtTm,Dispatch DtTm,Response DtTm,...,ALS Unit,Call Type Group,Number of Alarms,Unit Type,Unit sequence in call dispatch,Fire Prevention District,Supervisor District,Neighborhooods - Analysis Boundaries,Location,RowID
0,190824304,KM11,19035264,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:58:14 PM,03/24/2019 12:00:09 AM,03/24/2019 12:00:36 AM,03/24/2019 12:01:01 AM,...,False,Non Life-threatening,1,PRIVATE,1,2,5,Western Addition,"(37.78200642291339, -122.42822947127583)",190824304-KM11
1,190824295,KM03,19035263,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:56:34 PM,03/23/2019 11:56:34 PM,03/23/2019 11:56:59 PM,03/23/2019 11:57:47 PM,...,False,Potentially Life-Threatening,1,PRIVATE,2,1,3,Financial District/South Beach,"(37.7980449492818, -122.3963670843851)",190824295-KM03
2,190824295,E28,19035263,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:56:34 PM,03/23/2019 11:56:34 PM,03/23/2019 11:56:59 PM,03/23/2019 11:57:46 PM,...,False,Potentially Life-Threatening,1,ENGINE,1,1,3,Financial District/South Beach,"(37.7980449492818, -122.3963670843851)",190824295-E28
3,190824278,59,19035262,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:48:04 PM,03/23/2019 11:50:41 PM,03/23/2019 11:50:59 PM,03/23/2019 11:51:18 PM,...,True,Non Life-threatening,1,MEDIC,1,9,11,Excelsior,"(37.709059057853175, -122.45174696338128)",190824278-59
4,190824270,E29,19035261,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:48:21 PM,03/23/2019 11:49:36 PM,03/23/2019 11:50:31 PM,03/23/2019 11:51:45 PM,...,True,Non Life-threatening,1,ENGINE,1,2,6,South of Market,"(37.77128552595309, -122.41320426710206)",190824270-E29

### excel file

In [68]:
df = pd.read_excel("data\\Fire_Department_Calls_for_Service_03_23_2019.xlsx",
                  sheet_name='Sheet1',
                   #index_col=None, 
                   #header=None,
                   dtype={'Name': str, 'Value': float})
df.head(2)

,Call Number,Unit ID,Incident Number,Call Type,Call Date,Watch Date,Received DtTm,Entry DtTm,Dispatch DtTm,Response DtTm,...,ALS Unit,Call Type Group,Number of Alarms,Unit Type,Unit sequence in call dispatch,Fire Prevention District,Supervisor District,Neighborhooods - Analysis Boundaries,Location,RowID
0,190824304,KM11,19035264,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:58:14 PM,03/24/2019 12:00:09 AM,03/24/2019 12:00:36 AM,03/24/2019 12:01:01 AM,...,False,Non Life-threatening,1,PRIVATE,1,2,5,Western Addition,"(37.78200642291339, -122.42822947127583)",190824304-KM11
1,190824295,KM03,19035263,Medical Incident,03/23/2019,03/23/2019,03/23/2019 11:56:34 PM,03/23/2019 11:56:34 PM,03/23/2019 11:56:59 PM,03/23/2019 11:57:47 PM,...,False,Potentially Life-Threatening,1,PRIVATE,2,1,3,Financial District/South Beach,"(37.7980449492818, -122.3963670843851)",190824295-KM03

### <center style='color:blue'>DataFrame to Numpy NDArray </center>
### <center style='color:blue'> من بانداس الى نامباي </center>

In [74]:
a = df.values

In [75]:
type(a)

numpy.ndarray

In [76]:
a

array([[190824304, 'KM11', 19035264, ..., 'Western Addition',
        '(37.78200642291339, -122.42822947127583)', '190824304-KM11'],
       [190824295, 'KM03', 19035263, ...,
        'Financial District/South Beach',
        '(37.7980449492818, -122.3963670843851)', '190824295-KM03'],
       [190824295, 'E28', 19035263, ...,
        'Financial District/South Beach',
        '(37.7980449492818, -122.3963670843851)', '190824295-E28'],
       ...,
       [190820023, 'E38', 19034833, ..., 'Pacific Heights',
        '(37.786458147838374, -122.43077642337992)', '190820023-E38'],
       [190820010, 'QRV1', 19034832, ...,
        'Financial District/South Beach',
        '(37.784660412196764, -122.39991472915987)', '190820010-QRV1'],
       [190820010, 84, 19034832, ..., 'Financial District/South Beach',
        '(37.784660412196764, -122.39991472915987)', '190820010-84']],
      dtype=object)